Revit 2026 API

# StructuralConnectionCodeCheckingStatus Enumeration

---

An enumerated type listing all code checking status of the structural connection element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StructuralConnectionCodeCheckingStatus
```
```vb
Public Enumeration StructuralConnectionCodeCheckingStatus
```
```cpp
public enum class StructuralConnectionCodeCheckingStatus
```
```fsharp
type StructuralConnectionCodeCheckingStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| CheckingFailed | 2 | Status checking failed. |
| NotCalculated | 0 | Status not calculated. |
| OkChecked | 1 | Status OK checked. |

#### Reference

Autodesk.Revit.DB.Structure Namespace